zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pic32cm6408pl10064.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M0PLUS exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void SYSTEM_Handler                ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void NVMCTRL_Handler               ( void );
void DMAC_Handler                  ( void );
void EVSYS_Handler                 ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TCC0_Handler                  ( void );
void ADC0_Handler                  ( void );
void AC_Handler                    ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M0PLUS Processor and Core Peripherals */
#define __CM0PLUS_REV                 0x0001 /* Cortex-M0+ Core Revision                                                  */
#define __MPU_PRESENT                      0 /* MPU present or not                                                        */
#define __NVIC_PRIO_BITS                   2 /* Number of Bits used for Priority Levels                                   */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */

/* CMSIS includes */
#include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cm6408pl10064.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CM6408PL10064         */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/ccl.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/hmatrixb.h"
#include "component/mclk.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/sysctrl.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*                INSTANCE DEFINITIONS FOR PIC32CM6408PL10064                 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc0.h"
#include "instance/ccl.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/hmatrixhs.h"
#include "instance/mclk.h"
#include "instance/mtb.h"
#include "instance/nvmctrl.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/ptc.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/supc.h"
#include "instance/sysctrl.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tcc0.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CM6408PL10064              */
/* ************************************************************************** */
#define ID_PAC           (  0) /* Instance index for PAC (PAC) */
#define ID_PM            (  1) /* Instance index for PM (PM) */
#define ID_MCLK          (  2) /* Instance index for MCLK (MCLK) */
#define ID_RSTC          (  3) /* Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  4) /* Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  5) /* Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_SUPC          (  6) /* Instance index for SUPC (SUPC) */
#define ID_GCLK          (  7) /* Instance index for GCLK (GCLK) */
#define ID_WDT           (  8) /* Instance index for WDT (WDT) */
#define ID_RTC           (  9) /* Instance index for RTC (RTC) */
#define ID_EIC           ( 10) /* Instance index for EIC (EIC) */
#define ID_PORT          ( 32) /* Instance index for PORT (PORT) */
#define ID_DSU           ( 33) /* Instance index for DSU (DSU) */
#define ID_NVMCTRL       ( 34) /* Instance index for NVMCTRL (NVMCTRL) */
#define ID_DMAC          ( 35) /* Instance index for DMAC (DMAC) */
#define ID_MTB           ( 36) /* Instance index for MTB (MTB) */
#define ID_HMATRIXHS     ( 37) /* Instance index for HMATRIXHS (HMATRIXHS) */
#define ID_EVSYS         ( 64) /* Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 65) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 66) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_TC0           ( 67) /* Instance index for TC0 (TC0) */
#define ID_TC1           ( 68) /* Instance index for TC1 (TC1) */
#define ID_TC2           ( 69) /* Instance index for TC2 (TC2) */
#define ID_TCC0          ( 70) /* Instance index for TCC0 (TCC0) */
#define ID_ADC0          ( 71) /* Instance index for ADC0 (ADC0) */
#define ID_AC            ( 72) /* Instance index for AC (AC) */
#define ID_CCL           ( 73) /* Instance index for CCL (CCL) */
#define ID_PTC           ( 74) /* Instance index for PTC (PTC) */
#define ID_SYSCTRL       ( 75) /* Instance index for SYSCTRL (SYSCTRL) */

#define ID_PERIPH_MAX    ( 75) /* Number of peripheral IDs */

/* ************************************************************************** */
/*       REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CM6408PL10064        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42002000)                 /* AC Registers Address         */
#define ADC0_REGS                        ((adc_registers_t*)0x42001c00)                /* ADC0 Registers Address       */
#define CCL_REGS                         ((ccl_registers_t*)0x42002400)                /* CCL Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x41006000)               /* DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002800)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x42000000)              /* EVSYS Registers Address      */
#define FUSES_BOOTCFG_REGS               ((fuses_bootcfg_registers_t*)0x0d000400)      /* FUSES Registers Address      */
#define FUSES_SIGNATURE_REGS             ((fuses_signature_registers_t*)0x0d000200)    /* FUSES Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001c00)               /* GCLK Registers Address       */
#define HMATRIXHS_REGS                   ((hmatrixb_registers_t*)0x4100a000)           /* HMATRIXHS Registers Address  */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000800)               /* MCLK Registers Address       */
#define MTB_REGS                         ((mtb_registers_t*)0x41008000)                /* MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /* NVMCTRL Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001400)         /* OSC32KCTRL Registers Address */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40001000)            /* OSCCTRL Registers Address    */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /* PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x40000400)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x41000000)               /* PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x50000000)               /* PORT Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000c00)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002400)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000400)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000800)             /* SERCOM1 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001800)               /* SUPC Registers Address       */
#define SYSCTRL_REGS                     ((sysctrl_registers_t*)0x42002c00)            /* SYSCTRL Registers Address    */
#define TC0_REGS                         ((tc_registers_t*)0x42000c00)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42001000)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42001400)                 /* TC2 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42001800)                /* TCC0 Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x40002000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*              BASE ADDRESS DEFINITIONS FOR PIC32CM6408PL10064               */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x42002000)                          /* AC Base Address */
#define ADC0_BASE_ADDRESS                _UINT32_(0x42001c00)                          /* ADC0 Base Address */
#define CCL_BASE_ADDRESS                 _UINT32_(0x42002400)                          /* CCL Base Address */
#define DMAC_BASE_ADDRESS                _UINT32_(0x41006000)                          /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x41002000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x40002800)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x42000000)                          /* EVSYS Base Address */
#define FUSES_BOOTCFG_BASE_ADDRESS       _UINT32_(0x0d000400)                          /* FUSES Base Address */
#define FUSES_SIGNATURE_BASE_ADDRESS     _UINT32_(0x0d000200)                          /* FUSES Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x40001c00)                          /* GCLK Base Address */
#define HMATRIXHS_BASE_ADDRESS           _UINT32_(0x4100a000)                          /* HMATRIXHS Base Address */
#define MCLK_BASE_ADDRESS                _UINT32_(0x40000800)                          /* MCLK Base Address */
#define MTB_BASE_ADDRESS                 _UINT32_(0x41008000)                          /* MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UINT32_(0x41004000)                          /* NVMCTRL Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UINT32_(0x40001400)                          /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UINT32_(0x40001000)                          /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UINT32_(0x40000000)                          /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x40000400)                          /* PM Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x41000000)                          /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UINT32_(0x50000000)                          /* PORT Base Address */
#define RSTC_BASE_ADDRESS                _UINT32_(0x40000c00)                          /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x40002400)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x42000400)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x42000800)                          /* SERCOM1 Base Address */
#define SUPC_BASE_ADDRESS                _UINT32_(0x40001800)                          /* SUPC Base Address */
#define SYSCTRL_BASE_ADDRESS             _UINT32_(0x42002c00)                          /* SYSCTRL Base Address */
#define TC0_BASE_ADDRESS                 _UINT32_(0x42000c00)                          /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x42001000)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x42001400)                          /* TC2 Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x42001800)                          /* TCC0 Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x40002000)                          /* WDT Base Address */

/* ************************************************************************** */
/*                   PIO DEFINITIONS FOR PIC32CM6408PL10064                   */
/* ************************************************************************** */
#include "pio/pic32cm6408pl10064.h"

/* ************************************************************************** */
/*             MEMORY MAPPING DEFINITIONS FOR PIC32CM6408PL10064              */
/* ************************************************************************** */
#define BROM_SIZE                      _UINT32_(0x00008000)    /*   32kB Memory segment type: rom */
#define FLASH_SIZE                     _UINT32_(0x00010000)    /*   64kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UINT32_(       512)
#define FLASH_NB_OF_PAGES              _UINT32_(       128)

#define BOOTCFG_SIZE                   _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define SIGNATURE_SIZE                 _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define HSRAM_SIZE                     _UINT32_(0x00002000)    /*    8kB Memory segment type: ram */
#define APBA_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: io */
#define APBB_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define APBC_SIZE                      _UINT32_(0x00008000)    /*   32kB Memory segment type: io */
#define IOBUS_SIZE                     _UINT32_(0x00000200)    /*    0kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */

#define BROM_ADDR                      _UINT32_(0x00000000)    /* BROM base address (type: rom)*/
#define FLASH_ADDR                     _UINT32_(0x0c000000)    /* FLASH base address (type: flash)*/
#define BOOTCFG_ADDR                   _UINT32_(0x0d000400)    /* BOOTCFG base address (type: fuses)*/
#define SIGNATURE_ADDR                 _UINT32_(0x0d000200)    /* SIGNATURE base address (type: fuses)*/
#define HSRAM_ADDR                     _UINT32_(0x20000000)    /* HSRAM base address (type: ram)*/
#define APBA_ADDR                      _UINT32_(0x40000000)    /* APBA base address (type: io)*/
#define APBB_ADDR                      _UINT32_(0x41000000)    /* APBB base address (type: io)*/
#define APBC_ADDR                      _UINT32_(0x42000000)    /* APBC base address (type: io)*/
#define IOBUS_ADDR                     _UINT32_(0x50000000)    /* IOBUS base address (type: io)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*                  DEVICE SIGNATURES FOR PIC32CM6408PL10064                  */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X0BA03053)

/* ************************************************************************** */
/*               ELECTRICAL DEFINITIONS FOR PIC32CM6408PL10064                */
/* ************************************************************************** */

